hathach/tinyusb/src/portable/wch/dcd_ch32h417_usbhs.c
/*
 * SPDX-FileCopyrightText: Copyright (c) 2026 Ha Thach (tinyusb.org)
 * SPDX-License-Identifier: MIT
 *
 * This file is part of the TinyUSB stack.
 */

// USB2.0 high-speed device driver for the WCH CH32H417/CH32H416 USBHS controller
// (@0x40030000). This is WCH's newer USBHS device IP (also on CH564/CH585): per-endpoint
// completion via INT_ST (EP_DIR + EP_ID), a SETUP flag in UEP0_RX_CTRL (RB_UEP_R_SETUP_IS),
// per-endpoint DONE flags, split UEP_TX_EN/UEP_RX_EN enable registers, response encoding
// NAK=00 / STALL=01 / ACK=10, and manual data-toggle. It is NOT register-compatible with the
// CH32V307 (dcd_ch32_usbhs.c) or CH56x (dcd_ch56x_usbhs.c) USBHS blocks. The overall transfer
// state machine mirrors those drivers; the register access and interrupt dispatch are H417.
//
// The driver core is exposed as ch32h417_usb2_* internals (see dcd_ch32h417.h) so the USB3 dcd
// can dispatch to it for the runtime USB2 fallback; the standalone dcd_* entry points below are
// compiled when the USBHS controller is the selected controller (SPEED=high).

#include "tusb_option.h"

#if CFG_TUD_ENABLED && defined(TUP_USBIP_WCH_USBHS_H417) && \
    ((defined(CFG_TUD_WCH_USBIP_USBHS) && CFG_TUD_WCH_USBIP_USBHS == 1) || \
     (defined(CFG_TUD_WCH_USBIP_USB30) && CFG_TUD_WCH_USBIP_USB30 == 1 && \
      defined(CFG_TUD_WCH_USB30_FALLBACK) && CFG_TUD_WCH_USB30_FALLBACK == 1))

#include "device/dcd.h"
#include "dcd_ch32h417.h"
#include "ch32h417_usbhs_reg.h"


// Max number of bi-directional endpoints including EP0 (EP0..EP7)
#define EP_MAX 8
// USB 2.0 EP0 max packet size is 64; a SuperSpeed-capable build sets CFG_TUD_ENDPOINT0_SIZE to 512
#define EP0_MAX_SIZE TU_MIN(CFG_TUD_ENDPOINT0_SIZE, 64)

typedef struct {
  uint8_t *buffer;
  uint16_t total_len;
  uint16_t queued_len;
  uint16_t max_size;
  bool     is_iso;
  bool     valid;
} xfer_ctl_t;

#define XFER_CTL_BASE(_ep, _dir) (&xfer_status[_ep][_dir])
static xfer_ctl_t xfer_status[EP_MAX][2];

// EP0 DMA buffer: sized by the USB2 EP0 max packet, not CFG_TUD_ENDPOINT0_SIZE (512 on a
// SuperSpeed-capable build) - UEP0_MAX_LEN is a 7-bit field (RM 25.2.1.25), EP0 never moves more
TU_ATTR_ALIGNED(4) static uint8_t ep0_buffer[EP0_MAX_SIZE];
static volatile bool ep0_tog;    // EP0 expected IN toggle
static volatile bool ep0_rx_tog; // EP0 expected OUT toggle
static volatile bool sof_enabled; // usbd asked for SOF (see the RX_SOF branch in the ISR)
static volatile bool bus_suspended; // last suspend state reported to usbd (see the SUSPEND branch)
static volatile bool ep_data_tog[EP_MAX][2];

//--------------------------------------------------------------------+
// Endpoint helpers
//--------------------------------------------------------------------+

// Read-modify-write of the response / toggle field. The DONE bit (bit 7) is deliberately written
// back as 1: it is RW0 (RM 25.2.1.31/32/34/35 - "writes 0 to clear it"), so writing 1 cannot set it
// and cannot raise a completion, while writing 0 WOULD acknowledge one. Without the forced 1, a
// completion the SIE raises between this read and its write is silently cleared and never reported,
// hanging that transfer until the host times out. These helpers run in task context and are not
// confined to idle endpoints - edpt_stall()/edpt_clear_stall() call them on an endpoint that may be
// actively armed and ACKing, because a class driver may halt an endpoint with a transfer in flight
// (usbtest case 13 does exactly that).
static void set_tx_res(uint8_t ep_num, uint8_t res) {
  EP_TX_CTRL(ep_num) = (uint8_t)((EP_TX_CTRL(ep_num) & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_DONE | res);
}

static void set_rx_res(uint8_t ep_num, uint8_t res) {
  EP_RX_CTRL(ep_num) = (uint8_t)((EP_RX_CTRL(ep_num) & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_DONE | res);
}

static void set_ep_toggle(uint8_t ep_num, tusb_dir_t ep_dir, bool data1) {
  if (ep_dir == TUSB_DIR_IN) {
    EP_TX_CTRL(ep_num) = (uint8_t)((EP_TX_CTRL(ep_num) & ~USBHS_UEP_T_TOG_MASK) | USBHS_UEP_T_DONE |
                                   (data1 ? USBHS_UEP_T_TOG_DATA1 : USBHS_UEP_T_TOG_DATA0));
  } else {
    EP_RX_CTRL(ep_num) = (uint8_t)((EP_RX_CTRL(ep_num) & ~USBHS_UEP_R_TOG_MASK) | USBHS_UEP_R_DONE |
                                   (data1 ? USBHS_UEP_R_TOG_DATA1 : USBHS_UEP_R_TOG_DATA0));
  }
}

// Arm EP0 OUT: full-byte write (not a read-modify-write), so the response and the expected toggle
// land without carrying over stale status bits. EP0 has no hardware auto-toggle
// (R16_UEP_R_TOG_AUTO covers EP1..EP7 only), so the expected toggle comes from ep0_rx_tog.
// NOTE: being a full-byte write this clears RB_UEP_R_DONE, so it must never run while an
// unserviced RX completion is pending. Both call sites are clear of that: update_out() re-arms for
// the next packet of a multi-packet control-OUT, having just had that packet's DONE cleared by the
// scan, and edpt_xfer() runs with EP0 NAKing, since usbd submits a stage only once the previous
// one has completed, so no transaction is in flight to raise DONE underneath it.
static void arm_ep0_out(void) {
  EP_RX_CTRL(0) = (uint8_t)((ep0_rx_tog ? USBHS_UEP_R_TOG_DATA1 : USBHS_UEP_R_TOG_DATA0) | USBHS_UEP_R_RES_ACK);
}

static void queue_in_packet(uint8_t ep_num, xfer_ctl_t *xfer) {
  uint16_t remaining = xfer->total_len - xfer->queued_len;
  uint16_t tx_len = TU_MIN(remaining, xfer->max_size);

  if (ep_num == 0) {
    memcpy(ep0_buffer, &xfer->buffer[xfer->queued_len], tx_len);
  } else {
    EP_TX_DMA(ep_num) = (uint32_t)(uintptr_t)&xfer->buffer[xfer->queued_len];
  }

  EP_TX_LEN(ep_num) = tx_len;
  xfer->queued_len += tx_len;

  if (ep_num == 0) {
    EP_TX_CTRL(0) = (uint8_t)(USBHS_UEP_T_RES_ACK | (ep0_tog ? USBHS_UEP_T_TOG_DATA1 : USBHS_UEP_T_TOG_DATA0));
    ep0_tog = !ep0_tog;
  } else if (xfer->is_iso) {
    set_tx_res(ep_num, USBHS_UEP_T_RES_ACK); // isochronous: no handshake
  } else {
    set_ep_toggle(ep_num, TUSB_DIR_IN, ep_data_tog[ep_num][TUSB_DIR_IN]);
    set_tx_res(ep_num, USBHS_UEP_T_RES_ACK);
  }
}

