hathach/tinyusb/src/portable/wch/dcd_ch32h417_usbhs.c
static void queue_out_packet(uint8_t ep_num, xfer_ctl_t *xfer) {
  uint16_t remaining = xfer->total_len - xfer->queued_len;
  uint16_t rx_len = TU_MIN(remaining, xfer->max_size);

  if (ep_num > 0) {
    EP_RX_DMA(ep_num) = (uint32_t)(uintptr_t)&xfer->buffer[xfer->queued_len];
    EP_MAX_LEN(ep_num) = rx_len;
  }

  if (ep_num == 0) {
    set_rx_res(0, USBHS_UEP_R_RES_ACK);
  } else if (xfer->is_iso) {
    set_rx_res(ep_num, USBHS_UEP_R_RES_ACK);
  } else {
    set_ep_toggle(ep_num, TUSB_DIR_OUT, ep_data_tog[ep_num][TUSB_DIR_OUT]);
    set_rx_res(ep_num, USBHS_UEP_R_RES_ACK);
  }
}

static void update_in(uint8_t rhport, uint8_t ep_num, bool force) {
  xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, TUSB_DIR_IN);
  if (!xfer->valid) {
    return;
  }

  if (!force && ep_num != 0 && !xfer->is_iso) {
    ep_data_tog[ep_num][TUSB_DIR_IN] = !ep_data_tog[ep_num][TUSB_DIR_IN];
  }

  if (force || (xfer->total_len > xfer->queued_len)) {
    queue_in_packet(ep_num, xfer);
  } else {
    xfer->valid = false;
    if (ep_num == 0) {
      EP_TX_CTRL(0) = (uint8_t)(USBHS_UEP_T_RES_NAK | (ep0_tog ? USBHS_UEP_T_TOG_DATA1 : USBHS_UEP_T_TOG_DATA0));
    } else {
      set_tx_res(ep_num, USBHS_UEP_T_RES_NAK);
    }
    dcd_event_xfer_complete(rhport, ep_num | TUSB_DIR_IN_MASK, xfer->queued_len, XFER_RESULT_SUCCESS, true);
  }
}

static void update_out(uint8_t rhport, uint8_t ep_num, uint16_t rx_len) {
  xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, TUSB_DIR_OUT);
  if (!xfer->valid) {
    return;
  }

  uint16_t remaining = xfer->total_len - xfer->queued_len;
  uint16_t len = TU_MIN(rx_len, TU_MIN(remaining, xfer->max_size));

  if (ep_num == 0) {
    memcpy(&xfer->buffer[xfer->queued_len], ep0_buffer, len);
  }

  xfer->queued_len += len;

  if (ep_num != 0 && !xfer->is_iso) {
    ep_data_tog[ep_num][TUSB_DIR_OUT] = !ep_data_tog[ep_num][TUSB_DIR_OUT];
  }

  if ((xfer->queued_len == xfer->total_len) || (len < xfer->max_size)) {
    xfer->valid = false;
    if (ep_num == 0) {
      set_rx_res(0, USBHS_UEP_R_RES_NAK);
    }
    dcd_event_xfer_complete(rhport, ep_num, xfer->queued_len, XFER_RESULT_SUCCESS, true);
  }

  if (ep_num == 0) {
    // Manual-toggle hardware: advance the expected EP0 RX toggle on every received packet. usbd
    // submits a control-OUT data stage one EP0-sized chunk per dcd_edpt_xfer(), so the toggle must
    // survive across chunks (packet 2, 4, ... are DATA0) as well as within a multi-packet stage.
    ep0_rx_tog = !ep0_rx_tog;
    if (xfer->valid) {
      arm_ep0_out();
    }
  } else if (xfer->valid) {
    queue_out_packet(ep_num, xfer);
  } else {
    set_rx_res(ep_num, xfer->is_iso ? USBHS_UEP_R_RES_ACK : USBHS_UEP_R_RES_NAK);
  }
}

//--------------------------------------------------------------------+
// Controller internals, shared with the USB3.0 dcd for runtime fallback
//--------------------------------------------------------------------+

bool ch32h417_usb2_init(uint8_t rhport) {
  (void)rhport;

  memset(&xfer_status, 0, sizeof(xfer_status));
  memset((void *)ep_data_tog, 0, sizeof(ep_data_tog));
  ep0_tog = true;
  ep0_rx_tog = false;
  // Reset every latch this file keeps, not just the toggles: init rewrites INT_EN below without
  // USBHS_UDIE_SOF_ACT, so a sof_enabled left over from a previous life would leave the software
  // latch on with the hardware enable off. The RX_SOF branch is reached on any interrupt that
  // leaves no transfer pending, so it would emit SOF events usbd never asked for - and usbd turns
  // an unexpected SOF into a RESUME, cancelling a genuine suspend. This runs on the USB3 fallback
  // path and on tud_deinit()/tud_init(), so these flags genuinely survive across it.
  sof_enabled = false;
  bus_suspended = false;

  // 480 MHz USBHS PLL (HSE 25 MHz reference) + UTMI + peripheral clock, transcribed from the
  // vendor USBHS_RCC_Init. Without this the controller accepts register writes but the PHY
  // never drives D+/D-: the host then detects only the idle debug-probe level on the shared
  // PB8/PB9 pins as a phantom low-speed device (error -71 churn; seen on hardware). The USB3
  // fallback path also needs it: usbss_device_init(false) turns UTMI off again on the way here.
  if ((RCC->PLLCFGR & RCC_SYSPLL_SEL) != RCC_SYSPLL_USBHS) {
    RCC_USBHS_PLLCmd(DISABLE);
    RCC_USBHSPLLCLKConfig(RCC_USBHSPLLSource_HSE);
    RCC_USBHSPLLReferConfig(RCC_USBHSPLLRefer_25M);
    RCC_USBHSPLLClockSourceDivConfig(RCC_USBHSPLL_IN_Div1);
    RCC_USBHS_PLLCmd(ENABLE);
    // bounded, best effort: a PLL that never locks (e.g. bad HSE) must not hang the core - in the
    // USB3 fallback path this runs from the LINK ISR
    uint32_t timeout = 1000000;
    while (!(RCC->CTLR & RCC_USBHS_PLLRDY) && --timeout) {}
  }
  RCC_UTMIcmd(ENABLE);
  RCC_HBPeriphClockCmd(RCC_HBPeriph_USBHS, ENABLE);

  USBHSD->CONTROL = USBHS_UD_RST_LINK | USBHS_UD_PHY_SUSPENDM;
  // vendor-exact interrupt set: BUS_SLEEP/LPM_ACT/LINK_RDY are cleared-if-unhandled by the ISR
  USBHSD->INT_EN = USBHS_UDIE_BUS_RST | USBHS_UDIE_SUSPEND | USBHS_UDIE_BUS_SLEEP |
                   USBHS_UDIE_LPM_ACT | USBHS_UDIE_TRANSFER | USBHS_UDIE_LINK_RDY;

  // Only EP0 enabled at reset; data endpoints are enabled by dcd_edpt_open
  USBHSD->UEP_TX_EN = USBHS_UEP0_T_EN;
  USBHSD->UEP_RX_EN = USBHS_UEP0_R_EN;
  USBHSD->UEP_TX_ISO = 0;
  USBHSD->UEP_RX_ISO = 0;

  USBHSD->UEP0_DMA = (uint32_t)(uintptr_t)ep0_buffer;
  // clamp: a SuperSpeed-capable build sets CFG_TUD_ENDPOINT0_SIZE to 512, but on this USB2
  // fallback link EP0 max packet size is 64 (matches usbd's ep0_xact_limit and EP0_SIZE_FSHS)
  USBHSD->UEP0_MAX_LEN = EP0_MAX_SIZE;
  xfer_status[0][TUSB_DIR_OUT].max_size = EP0_MAX_SIZE;
  xfer_status[0][TUSB_DIR_IN].max_size = EP0_MAX_SIZE;

  EP_TX_LEN(0) = 0;
  EP_TX_CTRL(0) = USBHS_UEP_T_RES_NAK | USBHS_UEP_T_TOG_DATA0;
  EP_RX_CTRL(0) = USBHS_UEP_R_RES_ACK | USBHS_UEP_R_TOG_DATA0;

  for (uint8_t ep = 1; ep < EP_MAX; ep++) {
    EP_TX_LEN(ep) = 0;
    EP_TX_CTRL(ep) = USBHS_UEP_T_RES_NAK | USBHS_UEP_T_TOG_DATA0;
    EP_RX_CTRL(ep) = USBHS_UEP_R_RES_NAK | USBHS_UEP_R_TOG_DATA0;
    EP_MAX_LEN(ep) = 0;
  }

