hathach/tinyusb/src/portable/wch/dcd_ch32h417_usbhs.c
  USBHSD->BASE_MODE = USBHS_UD_SPEED_HIGH;
  USBHSD->DEV_AD = 0;
  USBHSD->CONTROL = USBHS_UD_DEV_EN | USBHS_UD_DMA_EN | USBHS_UD_LPM_EN | USBHS_UD_PHY_SUSPENDM;

  return true;
}

void ch32h417_usb2_deinit(void) {
  // Mask and acknowledge before resetting the SIE. Resetting the SIE does not touch INT_EN or
  // INT_FG, so a flag latched by a prior fallback survives - and the USB3 dcd_init() path calls
  // this without first disabling USBHS_IRQn. That vector aliases to the USB3 handler
  // (hw/bsp/ch32h417/family.c), which takes the USB3 branch and never writes INT_FG, so the
  // still-asserted line re-enters the ISR forever. Mirrors ch56x_usb2_deinit().
  USBHSD->INT_EN = 0;
  USBHSD->INT_FG = 0xFF;
  USBHSD->CONTROL = USBHS_UD_RST_SIE | USBHS_UD_RST_LINK;
}

void ch32h417_usb2_connect(void) {
  USBHSD->CONTROL |= USBHS_UD_DEV_EN; // attach: enable the device (pull-up on)
}

void ch32h417_usb2_disconnect(void) {
  USBHSD->CONTROL &= (uint32_t)~USBHS_UD_DEV_EN; // detach: disable the device (pull-up off)
}

// Resume signalling: RB_UD_REMOTE_WKUP is RW1Z, the hardware drives K and clears the bit itself
// (vendor USBHS_Send_Resume)
void ch32h417_usb2_remote_wakeup(void) {
  USBHSD->WAKE_CTRL |= USBHS_UD_REMOTE_WKUP;
}

void ch32h417_usb2_int_enable(void) {
  NVIC_EnableIRQ(USBHS_IRQn);
}

void ch32h417_usb2_int_disable(void) {
  NVIC_DisableIRQ(USBHS_IRQn);
}

void ch32h417_usb2_edpt0_status_complete(uint8_t rhport, const tusb_control_request_t *request) {
  (void)rhport;
  if (request->bmRequestType_bit.recipient == TUSB_REQ_RCPT_DEVICE &&
      request->bmRequestType_bit.type == TUSB_REQ_TYPE_STANDARD &&
      request->bRequest == TUSB_REQ_SET_ADDRESS) {
    USBHSD->DEV_AD = (uint8_t)request->wValue;
  }
}

bool ch32h417_usb2_edpt_open(uint8_t rhport, const tusb_desc_endpoint_t *desc_edpt) {
  (void)rhport;
  const uint8_t ep_num = tu_edpt_number(desc_edpt->bEndpointAddress);
  const tusb_dir_t dir = tu_edpt_dir(desc_edpt->bEndpointAddress);
  TU_ASSERT(ep_num < EP_MAX);

  if (ep_num == 0) {
    return true;
  }

  xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, dir);
  xfer->max_size = tu_edpt_packet_size(desc_edpt);
  xfer->is_iso = (desc_edpt->bmAttributes.xfer == TUSB_XFER_ISOCHRONOUS);
  ep_data_tog[ep_num][dir] = false;

  if (dir == TUSB_DIR_OUT) {
    USBHSD->UEP_RX_EN |= (uint16_t)(USBHS_UEP0_R_EN << ep_num);
    if (xfer->is_iso) {
      USBHSD->UEP_RX_ISO |= (uint16_t)(1u << ep_num);
    }
    EP_MAX_LEN(ep_num) = xfer->max_size;
    EP_RX_CTRL(ep_num) = USBHS_UEP_R_RES_NAK | USBHS_UEP_R_TOG_DATA0;
  } else {
    USBHSD->UEP_TX_EN |= (uint16_t)(USBHS_UEP0_T_EN << ep_num);
    if (xfer->is_iso) {
      USBHSD->UEP_TX_ISO |= (uint16_t)(1u << ep_num);
    }
    EP_TX_LEN(ep_num) = 0;
    EP_TX_CTRL(ep_num) = USBHS_UEP_T_RES_NAK | USBHS_UEP_T_TOG_DATA0;
  }

  return true;
}

void ch32h417_usb2_edpt_close(uint8_t rhport, uint8_t ep_addr) {
  (void)rhport;
  const uint8_t ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir = tu_edpt_dir(ep_addr);
  TU_ASSERT(ep_num < EP_MAX, ); // tu_edpt_number() returns 0..15: an out-of-range id would write
                                // past the endpoint register block (mirror edpt_open)

  if (ep_num == 0) {
    return; // EP0 is never closed; its registers stay armed for the next control transfer
  }

  if (dir == TUSB_DIR_OUT) {
    EP_RX_CTRL(ep_num) = USBHS_UEP_R_RES_NAK | USBHS_UEP_R_TOG_DATA0;
    EP_MAX_LEN(ep_num) = 0;
    USBHSD->UEP_RX_ISO &= (uint16_t)~(1u << ep_num);
    USBHSD->UEP_RX_EN &= (uint16_t)~(USBHS_UEP0_R_EN << ep_num);
  } else {
    EP_TX_CTRL(ep_num) = USBHS_UEP_T_RES_NAK | USBHS_UEP_T_TOG_DATA0;
    EP_TX_LEN(ep_num) = 0;
    USBHSD->UEP_TX_ISO &= (uint16_t)~(1u << ep_num);
    USBHSD->UEP_TX_EN &= (uint16_t)~(USBHS_UEP0_T_EN << ep_num);
  }
  ep_data_tog[ep_num][dir] = false;
  XFER_CTL_BASE(ep_num, dir)->valid = false;
}

void ch32h417_usb2_edpt_close_all(uint8_t rhport) {
  (void)rhport;
  memset((void *)ep_data_tog, 0, sizeof(ep_data_tog));
  for (uint8_t ep = 1; ep < EP_MAX; ep++) {
    EP_TX_LEN(ep) = 0;
    EP_TX_CTRL(ep) = USBHS_UEP_T_RES_NAK | USBHS_UEP_T_TOG_DATA0;
    EP_RX_CTRL(ep) = USBHS_UEP_R_RES_NAK | USBHS_UEP_R_TOG_DATA0;
    EP_MAX_LEN(ep) = 0;
    xfer_status[ep][0].valid = false;
    xfer_status[ep][1].valid = false;
  }
  USBHSD->UEP_TX_EN = USBHS_UEP0_T_EN;
  USBHSD->UEP_RX_EN = USBHS_UEP0_R_EN;
  USBHSD->UEP_TX_ISO = 0;
  USBHSD->UEP_RX_ISO = 0;
}

bool ch32h417_usb2_edpt_xfer(uint8_t rhport, uint8_t ep_addr, uint8_t *buffer, uint16_t total_bytes) {
  const uint8_t ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir = tu_edpt_dir(ep_addr);

  xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, dir);
  xfer->buffer = buffer;
  xfer->total_len = total_bytes;
  xfer->queued_len = 0;
  xfer->valid = true;

  if (ep_num == 0 && dir == TUSB_DIR_OUT) {
    // Data or status OUT stage: ep0_rx_tog holds DATA1 right after a SETUP and is advanced per
    // received packet, so a multi-chunk control-write stays synchronized with the host.
    arm_ep0_out();
    return true;
  }

  if (dir == TUSB_DIR_IN) {
    update_in(rhport, ep_num, true);
  } else {
    queue_out_packet(ep_num, xfer);
  }

  return true;
}

void ch32h417_usb2_edpt_stall(uint8_t rhport, uint8_t ep_addr) {
  (void)rhport;
  const uint8_t ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir = tu_edpt_dir(ep_addr);
  // Same bound edpt_open()/edpt_close() apply: tu_edpt_number() yields 0..15, while the
  // endpoint register window and xfer_status hold EP_MAX. usbd already rejects a larger id
  // before it reaches here, so this is defence in depth, not a reachable hole.
  TU_ASSERT(ep_num < EP_MAX, );

  if (dir == TUSB_DIR_OUT) {
    set_rx_res(ep_num, USBHS_UEP_R_RES_STALL);
  } else {
    EP_TX_LEN(ep_num) = 0;
    set_tx_res(ep_num, USBHS_UEP_T_RES_STALL);
  }
}

void ch32h417_usb2_edpt_clear_stall(uint8_t rhport, uint8_t ep_addr) {
  (void)rhport;
  const uint8_t ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir = tu_edpt_dir(ep_addr);
  // Same bound edpt_open()/edpt_close() apply: tu_edpt_number() yields 0..15, while the
  // endpoint register window and xfer_status hold EP_MAX. usbd already rejects a larger id
  // before it reaches here, so this is defence in depth, not a reachable hole.
  TU_ASSERT(ep_num < EP_MAX, );

