hathach/tinyusb/src/portable/wch/dcd_ch32h417_usbhs.c
  if (dir == TUSB_DIR_OUT) {
    ep_data_tog[ep_num][TUSB_DIR_OUT] = false; // clear-halt resets the toggle to DATA0
    xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, TUSB_DIR_OUT);
    if (xfer->valid) {
      // A receive is still armed; re-queue it instead of leaving it NAKing (usbtest case 29
      // clears the halt on an armed bulk-OUT pipe).
      queue_out_packet(ep_num, xfer);
    } else {
      EP_RX_CTRL(ep_num) = USBHS_UEP_R_RES_NAK | USBHS_UEP_R_TOG_DATA0;
    }
  } else {
    ep_data_tog[ep_num][TUSB_DIR_IN] = false; // clear-halt resets the toggle to DATA0
    xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, TUSB_DIR_IN);
    if (xfer->valid) {
      // A transmit is still armed (the class driver considers it submitted and won't re-arm it);
      // re-queue it instead of leaving it NAKing (usbtest halt test 13 clears the halt on an armed
      // bulk-IN pipe). queued_len tracks ARMED bytes and edpt_stall (EP_TX_LEN=0) discarded exactly
      // the one armed packet: rewind only that packet, so a mid-transfer halt-clear does not
      // retransmit packets the host already ACKed.
      uint16_t rearm = (uint16_t)(xfer->queued_len % xfer->max_size);
      if (rearm == 0 && xfer->queued_len != 0) {
        rearm = xfer->max_size;
      }
      xfer->queued_len -= rearm;
      queue_in_packet(ep_num, xfer);
    } else {
      EP_TX_CTRL(ep_num) = USBHS_UEP_T_RES_NAK | USBHS_UEP_T_TOG_DATA0;
    }
  }
}

void ch32h417_usb2_sof_enable(uint8_t rhport, bool en) {
  sof_enabled = en;
  (void)rhport;
  if (en) {
    USBHSD->INT_EN |= USBHS_UDIE_SOF_ACT;
  } else {
    USBHSD->INT_EN &= (uint8_t)~USBHS_UDIE_SOF_ACT;
  }
}

void ch32h417_usb2_int_handler(uint8_t rhport) {
  uint8_t intflag = USBHSD->INT_FG;

  if (intflag & USBHS_UDIF_TRANSFER) {
    // RB_UDIF_RTX_ACT (INT_FG bit 4) is read-only and is the wired-OR of every endpoint's DONE
    // flag - RM 25.2.1.8: "Receive cleared by RB_UEP_R_DONE; Transmit cleared by RB_UEP_T_DONE" -
    // while INT_ST names only ONE endpoint. Servicing just that endpoint leaves the other
    // completion pending, and the SIE then refuses new transactions: a SETUP that arrives while
    // another endpoint still has DONE set gets no handshake at all. That is fatal, because a SETUP
    // may not be NAKed or STALLed - the host retries three times and fails with -EPROTO
    // (wire-confirmed: SETUP dropped 64 us after a bulk-IN on EP1 completed). So walk every
    // endpoint and drain all pending completions before leaving the handler, instead of trusting
    // INT_ST to name the only one that matters. RX is serviced before TX for each endpoint so that
    // a SETUP is dispatched first: an EP0 IN completion and the next SETUP are routinely pending
    // together, and the SETUP branch delivers that IN completion itself before resetting the
    // control pipe (see below) rather than discarding it.
    for (uint8_t ep_num = 0; ep_num < EP_MAX; ep_num++) {
      if (EP_RX_CTRL(ep_num) & USBHS_UEP_R_DONE) {
        // SETUP or OUT transaction.
        // RB_UEP_R_SETUP_IS (RM 25.2.1.32) is read-only and survives a software write, but the
        // hardware DOES clear it as soon as a non-SETUP packet is received - verified on hardware:
        // EP0 RX reads 0x34 (flag clear) immediately after a status OUT lands, while it still reads
        // set on a genuine SETUP completion. So the flag alone identifies a SETUP, which is also
        // what every WCH demo relies on.
        // Two narrower tests were tried here and are WRONG, do not reintroduce them:
        //   - gating on !xfer_status[0][OUT].valid suppresses the SETUP a host uses to abort an
        //     in-progress control-OUT (USB 2.0 8.5.3), where valid is legitimately still true;
        //   - gating on EP_RX_LEN(0) == 8 misreads any 8-byte control-OUT data packet (an 8-byte
        //     class/vendor payload, or usbtest's ctrl_out which varies the length 1..512) as a
        //     SETUP, feeding usbd garbage and discarding the real transfer.
        if (ep_num == 0 && (EP_RX_CTRL(0) & USBHS_UEP_R_SETUP_IS)) {
          tusb_control_request_t const *setup = (tusb_control_request_t const *)ep0_buffer;
          // The status-IN of the previous transfer and this SETUP are often pending together, and
          // the scan services RX before TX. Deliver that completion first: the pipe reset below
          // would drop it (xfer->valid cleared) and the full-byte TX write would clear its DONE,
          // so usbd would never run the transfer's CONTROL_STAGE_ACK - which is where classes
          // apply a received payload (hid_device.c applies SET_REPORT only on that stage).
          // Only when that transfer is actually finished, though. On an unfinished multi-packet
          // control-IN, update_in() would queue the NEXT packet, and queue_in_packet() memcpys it
          // into ep0_buffer - the very buffer holding the SETUP about to be handed to usbd, which
          // would arrive as stale descriptor bytes. A host may legally abort a control-IN with a
          // new SETUP (USB 2.0 8.5.3), e.g. cutting a GET_DESCRIPTOR short, so this is reachable.
          // An abandoned transfer has no completion worth reporting; the pipe reset below drops it.
          const xfer_ctl_t *ep0_in = XFER_CTL_BASE(0, TUSB_DIR_IN);
          if ((EP_TX_CTRL(0) & USBHS_UEP_T_DONE) && ep0_in->valid &&
              (ep0_in->total_len <= ep0_in->queued_len)) {
            EP_TX_CTRL(0) &= (uint8_t)~USBHS_UEP_T_DONE;
            update_in(rhport, 0, false);
          }
          ep0_tog = true;
          ep0_rx_tog = true;
          // A SETUP resets the control pipe: drop any stage still armed from a transfer the host
          // just abandoned, so it cannot later swallow a packet belonging to this new one.
          xfer_status[0][TUSB_DIR_OUT].valid = false;
          xfer_status[0][TUSB_DIR_IN].valid = false;
          // Full-byte writes (DATA1) clear DONE and set the post-SETUP toggle. RB_UEP_R_SETUP_IS is
          // read-only (RM 25.2.1.32) and survives this write - measured on hardware, EP0 RX reads
          // back with the flag still set. The hardware clears it when the next non-SETUP packet is
          // received, which is what keeps the SETUP test below from re-firing on a data-stage OUT.
          EP_TX_CTRL(0) = USBHS_UEP_T_RES_NAK | USBHS_UEP_T_TOG_DATA1;
          EP_RX_CTRL(0) = (uint8_t)(((setup->wLength == 0) ? USBHS_UEP_R_RES_ACK : USBHS_UEP_R_RES_NAK) |
                                    USBHS_UEP_R_TOG_DATA1);
          dcd_event_setup_received(rhport, ep0_buffer, true);
        } else {
          // A packet whose PID does not match the endpoint's expected toggle is a host retransmission
          // after a lost ACK: the SIE stores it and raises this interrupt anyway. RM 25.2.1.35
          // RB_UEP_R_TOG_MATCH (RO, bit 4 of UEPn_RX_CTRL): 1 = synchronized, 0 = not synchronized -
          // consuming an unsynchronized packet would inject it into the transfer twice. Dropping it
          // leaves the endpoint armed (DMA address and RES untouched) for the host's next attempt.
          // Only data endpoints are gated: their expected toggle is programmed on every arm, while
          // EP0 derives it from the control stages and iso endpoints run without handshake or toggle
          // (mirrors dcd_ch56x_usbhs.c).
          const uint8_t rx_ctrl = EP_RX_CTRL(ep_num);
          EP_RX_CTRL(ep_num) = (uint8_t)(rx_ctrl & ~USBHS_UEP_R_DONE);
          if ((ep_num == 0) || xfer_status[ep_num][TUSB_DIR_OUT].is_iso || (rx_ctrl & USBHS_UEP_R_TOG_MATCH)) {
            update_out(rhport, ep_num, EP_RX_LEN(ep_num));
          }
        }
      }

      if (EP_TX_CTRL(ep_num) & USBHS_UEP_T_DONE) {
        // IN transaction completed
        EP_TX_CTRL(ep_num) &= (uint8_t)~USBHS_UEP_T_DONE;
        update_in(rhport, ep_num, false);
      }
    }
    // The transfer interrupt is acknowledged by clearing the per-endpoint DONE bits above (matching
    // the vendor driver); do NOT also write INT_FG - RB_UDIF_RTX_ACT is read-only anyway.
  } else if (intflag & USBHS_UDIF_RX_SOF) {
    // The hardware sets RB_UDIF_RX_SOF every frame whether or not the SOF interrupt is enabled, so
    // this branch is reached on ANY interrupt that leaves no transfer pending. Emitting a SOF event
    // unasked flooded usbd's event queue within one enumeration (queue_event asserts, events lost,
    // the host sees the device drop) - and because the branch also short-circuits the chain, the
    // terminal else never ran and an enabled-but-unhandled flag kept the IRQ line asserted, so the
    // ISR re-entered immediately. Always clear the flag; only report it when usbd asked for it.
    USBHSD->INT_FG = USBHS_UDIF_RX_SOF;
    if (sof_enabled) {
      dcd_event_sof(rhport, USBHSD->FRAME_NO & USBHS_UD_FRAME_NO, true);
    }
  } else if (intflag & USBHS_UDIF_BUS_RST) {
    bus_suspended = false;
    dcd_event_bus_reset(rhport, TUSB_SPEED_HIGH, true);
    USBHSD->DEV_AD = 0;
    memset((void *)ep_data_tog, 0, sizeof(ep_data_tog));
    ep0_tog = true;
    ep0_rx_tog = false;
    EP_RX_CTRL(0) = USBHS_UEP_R_RES_ACK | USBHS_UEP_R_TOG_DATA0;
    EP_TX_CTRL(0) = USBHS_UEP_T_RES_NAK | USBHS_UEP_T_TOG_DATA0;
    USBHSD->INT_FG = USBHS_UDIF_BUS_RST;
  } else if (intflag & USBHS_UDIF_SUSPEND) {
    // This single interrupt fires on both suspend and resume; the live suspend status bit
    // distinguishes them. Clear first, then sample, like the vendor demo (CH372Device).
    // EDGE-TRIGGERED: the controller raises this constantly (measured on hardware: ~2000 times
    // during one enumeration), and queueing a usbd event each time overflows the event queue -
    // events are dropped, enumeration dies and the host sees the device disappear. usbd only
    // needs the transitions, so report a change of state and swallow the repeats.
    USBHSD->INT_FG = USBHS_UDIF_SUSPEND;
    const bool now_suspended = (USBHSD->MIS_ST & USBHS_UDMS_SUSPEND) != 0;
    if (now_suspended != bus_suspended) {
      bus_suspended = now_suspended;
      dcd_event_t event = {.rhport = rhport,
                           .event_id = now_suspended ? DCD_EVENT_SUSPEND : DCD_EVENT_RESUME};
      dcd_event_handler(&event, true);
    }
  } else {
    USBHSD->INT_FG = intflag;
  }
}

//--------------------------------------------------------------------+
// dcd API - compiled only when the USBHS controller is the active dcd (SPEED=high)
//--------------------------------------------------------------------+

#if defined(CFG_TUD_WCH_USBIP_USBHS) && CFG_TUD_WCH_USBIP_USBHS == 1

bool dcd_init(uint8_t rhport, const tusb_rhport_init_t *rh_init) {
  (void)rh_init;
  return ch32h417_usb2_init(rhport);
}

bool dcd_deinit(uint8_t rhport) {
  (void)rhport;
  ch32h417_usb2_int_disable();
  ch32h417_usb2_deinit();
  return true;
}

void dcd_int_enable(uint8_t rhport) { (void)rhport; ch32h417_usb2_int_enable(); }
void dcd_int_disable(uint8_t rhport) { (void)rhport; ch32h417_usb2_int_disable(); }
void dcd_int_handler(uint8_t rhport) { ch32h417_usb2_int_handler(rhport); }

void dcd_set_address(uint8_t rhport, uint8_t dev_addr) {
  (void)dev_addr;
  dcd_edpt_xfer(rhport, 0x80, NULL, 0, false); // status ZLP; address applied at status-complete
}

void dcd_remote_wakeup(uint8_t rhport) { (void)rhport; ch32h417_usb2_remote_wakeup(); }
void dcd_connect(uint8_t rhport) { (void)rhport; ch32h417_usb2_connect(); }
void dcd_disconnect(uint8_t rhport) { (void)rhport; ch32h417_usb2_disconnect(); }
void dcd_sof_enable(uint8_t rhport, bool en) { ch32h417_usb2_sof_enable(rhport, en); }

void dcd_edpt0_status_complete(uint8_t rhport, const tusb_control_request_t *request) {
  ch32h417_usb2_edpt0_status_complete(rhport, request);
}

bool dcd_edpt_open(uint8_t rhport, const tusb_desc_endpoint_t *desc_edpt) {
  return ch32h417_usb2_edpt_open(rhport, desc_edpt);
}
void dcd_edpt_close(uint8_t rhport, uint8_t ep_addr) { ch32h417_usb2_edpt_close(rhport, ep_addr); }
void dcd_edpt_close_all(uint8_t rhport) { ch32h417_usb2_edpt_close_all(rhport); }

bool dcd_edpt_xfer(uint8_t rhport, uint8_t ep_addr, uint8_t *buffer, uint16_t total_bytes, bool is_isr) {
  (void)is_isr;
  return ch32h417_usb2_edpt_xfer(rhport, ep_addr, buffer, total_bytes);
}

void dcd_edpt_stall(uint8_t rhport, uint8_t ep_addr) { ch32h417_usb2_edpt_stall(rhport, ep_addr); }
void dcd_edpt_clear_stall(uint8_t rhport, uint8_t ep_addr) { ch32h417_usb2_edpt_clear_stall(rhport, ep_addr); }

#endif

#endif
